# A F&B manager wants to determine whether there is any significant difference in the diameter of the cutlet between two units. A randomly selected sample of cutlets was collected from both units and measured? Analyze the data and draw inferences at 5% significance level. Please state the assumptions and tests that you carried out to check validity of the assumptions.â€‹

In [1]:
#import the libraries
import pandas as pd 
import numpy as np
import scipy
from scipy import stats

In [2]:
data = pd.read_csv("Cutlets.csv")
data.head()

   Unit A  Unit B
0  6.8090  6.7703
1  6.4376  7.5093
2  6.9157  6.7300
3  7.3012  6.7878
4  7.4488  7.1522

In [3]:
data.describe()

          Unit A     Unit B
count  35.000000  35.000000
mean    7.019091   6.964297
std     0.288408   0.343401
min     6.437600   6.038000
25%     6.831500   6.753600
50%     6.943800   6.939900
75%     7.280550   7.195000
max     7.516900   7.545900

In [4]:
data.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 35 entries, 0 to 34
Data columns (total 2 columns):
 #   Column  Non-Null Count  Dtype
---  ------  --------------  -----
 0   Unit A  35 non-null     float64
 1   Unit B  35 non-null     float64
dtypes: float64(2)
memory usage: 688.0 bytes

In [5]:
data.isnull().sum()

Unit A    0
Unit B    0
dtype: int64

In [6]:
data[data.duplicated()].shape

(0, 2)

In [7]:
Unit_A=pd.Series(data.iloc[:,0])
Unit_A

0     6.8090
1     6.4376
2     6.9157
3     7.3012
4     7.4488
5     7.3871
6     6.8755
7     7.0621
8     6.6840
9     6.8236
10    7.3930
11    7.5169
12    6.9246
13    6.9256
14    6.5797
15    6.8394
16    6.5970
17    7.2705
18    7.2828
19    7.3495
20    6.9438
21    7.1560
22    6.5341
23    7.2854
24    6.9952
25    6.8568
26    7.2163
27    6.6801
28    6.9431
29    7.0852
30    6.7794
31    7.2783
32    7.1561
33    7.3943
34    6.9405
Name: Unit A, dtype: float64

In [8]:
Unit_B=pd.Series(data.iloc[:,1])
Unit_B

0     6.7703
1     7.5093
2     6.7300
3     6.7878
4     7.1522
5     6.8110
6     7.2212
7     6.6606
8     7.2402
9     7.0503
10    6.8810
11    7.4059
12    6.7652
13    6.0380
14    7.1581
15    7.0240
16    6.6672
17    7.4314
18    7.3070
19    6.7478
20    6.8889
21    7.4220
22    6.5217
23    7.1688
24    6.7594
25    6.9399
26    7.0133
27    6.9182
28    6.3346
29    7.5459
30    7.0992
31    7.1180
32    6.6965
33    6.5780
34    7.3875
Name: Unit B, dtype: float64

In [9]:
# Sample size
len(data)

35

# Above A and B samples mean are different and they are indipendant sample

In [10]:
#Ho:There is no significant difference in the diameter of the cutlet between two units.
#Ha:There is a significant difference in the diameter of the cutlet between two units. 2 sample t test is applicable

In [11]:
# 2-sample 2-tail t test:  
t_test = stats.ttest_ind(Unit_A,Unit_B)
t_test

Ttest_indResult(statistic=0.7228688704678063, pvalue=0.4722394724599501)

In [12]:
# p value with Alfa is  0.5  significant level of comparing.
#(p_value=0.4722) > (Î± = 0.05); Accept Null Hypothesis. i.e. Î¼1 = Î¼2 ( Thus, there is no difference in diameters of cutlets between two units

#   A hospital wants to determine whether there is any difference in the average Turn Around Time (TAT) of reports of the laboratories on their preferred list. They collected a random sample and recorded TAT for reports of 4 laboratories. TAT is defined as sample collected to report dispatch.â€‹

In [13]:
import pandas as pd 
import numpy as np
import scipy
from scipy import stats

In [14]:
lab = pd.read_csv("LabTAT.csv")

In [15]:
lab.head()

   Laboratory 1  Laboratory 2  Laboratory 3  Laboratory 4
0        185.35        165.53        176.70        166.13
1        170.49        185.91        198.45        160.79
2        192.77        194.92        201.23        185.18
3        177.33        183.00        199.61        176.42
4        193.41        169.57        204.63        152.60

In [16]:
lab.describe()

       Laboratory 1  Laboratory 2  Laboratory 3  Laboratory 4
count    120.000000    120.000000    120.000000     120.00000
mean     178.361583    178.902917    199.913250     163.68275
std       13.173594     14.957114     16.539033      15.08508
min      138.300000    140.550000    159.690000     124.06000
25%      170.335000    168.025000    188.232500     154.05000
50%      178.530000    178.870000    199.805000     164.42500
75%      186.535000    189.112500    211.332500     172.88250
max      216.390000    217.860000    238.700000     205.18000

In [17]:
# Sample Size
len(lab)

120

In [18]:
lab.mean()

Laboratory 1    178.361583
Laboratory 2    178.902917
Laboratory 3    199.913250
Laboratory 4    163.682750
dtype: float64

# In this dataset there are multiple  samples then we can go to ANOVA test

In [19]:
stats.f_oneway(lab.iloc[:,0],lab.iloc[:,1],lab.iloc[:,2],lab.iloc[:,3])

F_onewayResult(statistic=118.70421654401437, pvalue=2.1156708949992414e-57)

# Sales of products in four different regions is tabulated for males and females. Find if male-female buyer rations are similar across regions.â€‹

In [20]:
import pandas as pd 
import numpy as np
import scipy
from scipy import stats

In [21]:
buy = pd.read_csv("BuyerRatio.csv")
buy.head()

  Observed Values  East  West  North  South
0           Males    50   142    131     70
1         Females   435  1523   1356    750

In [22]:
buy.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 2 entries, 0 to 1
Data columns (total 5 columns):
 #   Column           Non-Null Count  Dtype
---  ------           --------------  -----
 0   Observed Values  2 non-null      object
 1   East             2 non-null      int64
 2   West             2 non-null      int64
 3   North            2 non-null      int64
 4   South            2 non-null      int64
dtypes: int64(4), object(1)
memory usage: 208.0+ bytes

In [23]:
buy.describe()

             East         West        North       South
count    2.000000     2.000000     2.000000    2.000000
mean   242.500000   832.500000   743.500000  410.000000
std    272.236111   976.514465   866.205807  480.832611
min     50.000000   142.000000   131.000000   70.000000
25%    146.250000   487.250000   437.250000  240.000000
50%    242.500000   832.500000   743.500000  410.000000
75%    338.750000  1177.750000  1049.750000  580.000000
max    435.000000  1523.000000  1356.000000  750.000000

In [24]:
buy = [[50,142,131,70],[435,1523,1356,750]]
buy

[[50, 142, 131, 70], [435, 1523, 1356, 750]]

# Chi2 contengency independence test

In [26]:
from scipy.stats import chi2_contingency

In [28]:
chi_2 = chi2_contingency(buy)
print("test t = {}, Pvalue = {}".format(chi_2[0], chi_2[1]))

test t = 1.595945538661058, Pvalue = 0.6603094907091882

In [29]:
if p_val < 0.05:
    print('we are rejecting null hypothesis')
else: 
    print('we are accepting null hypothesis')

we are accepting null hypothesis

# TeleCall uses 4 centers around the globe to process customer order forms. They audit a certain %  of the customer order forms. Any error in order form renders it defective and has to be reworked before processing.  The manager wants to check whether the defective %  varies by centre. Please analyze the data at 5% significance level and help the manager draw appropriate inferences?

In [30]:
order = pd.read_csv("Costomer+OrderForm.csv")
order.head()

  Phillippines   Indonesia       Malta       India
0   Error Free  Error Free   Defective  Error Free
1   Error Free  Error Free  Error Free   Defective
2   Error Free   Defective   Defective  Error Free
3   Error Free  Error Free  Error Free  Error Free
4   Error Free  Error Free   Defective  Error Free

In [31]:
order['Phillippines'].value_counts()

Error Free    271
Defective      29
Name: Phillippines, dtype: int64

In [32]:
order['Indonesia'].value_counts()

Error Free    267
Defective      33
Name: Indonesia, dtype: int64

In [33]:
order['Malta'].value_counts()

Error Free    269
Defective      31
Name: Malta, dtype: int64

In [34]:
order['India'].value_counts()

Error Free    280
Defective      20
Name: India, dtype: int64

In [35]:
pd.DataFrame({'countary':['Phillippines','Indonesia','Malta','India'],'Error Free':[271,267,269,280],'Defective':[29,33,31,20]})

       countary  Error Free  Defective
0  Phillippines         271         29
1     Indonesia         267         33
2         Malta         269         31
3         India         280         20

In [36]:
order1 = np.array([[271,267,269,280],[29,33,31,20]])
order1

array([[271, 267, 269, 280],
       [ 29,  33,  31,  20]])

In [37]:
chi_2=chi2_contingency(order1) 
print("test t = {}, Pvalue = {}".format(chi_2[0], chi_2[1]))

test t = 3.858960685820355, Pvalue = 0.2771020991233135

In [38]:
if p_val < 0.05:
    print('The defective between percentage varies by center')
else:
    print('The defective between percentage not varies center')

The defective between percentage not varies center